package 객체연관관계;

public class Main {
    public static void main(String[] args) {

        System.out.println("Main.main");

        // 단방향 관계
        회원 A객체 = 회원.builder().회원번호(1).회원아이디("admin").회원이름("유재석").build();

        // 객체 A의 글쓰기 진행
        게시물 B객체 = 게시물.builder().게시물번호(1)
                .게시물제목("유재석이 쓴 글")
                .게시물내용("게시물 내용")
                .작성한회원(A객체)
                .build();

        // ------------------------------------------------------------------
        // 4. 게시물 댓글 달기 ( C객체 사용, 비회원제 )

        댓글 C객체 = 댓글.builder()
                .댓글번호(1)
                .댓글내용("댓글1")
                .댓글게시물(B객체)
                .build();


        // ------------------------------------------------------------------
        // 5. 양방향 관계 [ 내가 쓴 글 확인 ]
        A객체.get내가쓴글().add(B객체);

        게시물 D객체 = 게시물.builder()
                .게시물번호(2)
                .게시물제목("제목2")
                .게시물내용("내용2")
                .작성한회원(A객체)
                .build();

    }

}
